In [1]:
import pandas as pd

In [2]:
cities_df = pd.read_csv('data/world_cities.csv')
cities_df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [6]:
cities_df.shape

(249, 5)

In [4]:
cities_df['City / Urban area'].describe()

count        249
unique       249
top       Tucson
freq           1
Name: City / Urban area, dtype: object

In [12]:
cities_df['City / Urban area'].value_counts().shape

(249,)

In [7]:
cities_df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [11]:
cities_df['Country'].value_counts().shape

(61,)

In [18]:
cities_df['Density'] = cities_df['Population'] / cities_df['Land area (in sqKm)']

In [21]:
cities_df[ cities_df['Density'] > 10000 ].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19 entries, 32 to 129
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           19 non-null     int64
 1   City / Urban area    19 non-null     object
 2   Country              19 non-null     object
 3   Population           19 non-null     int64
 4   Land area (in sqKm)  19 non-null     int64
 5   Density              19 non-null     float64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.0+ KB

In [22]:
cities_df[cities_df['Density'] > 10000].value_counts().shape

(19,)

In [31]:
cities_df.sort_values(by='Density', ascending=False)['City / Urban area']

75              Mumbai
74             Kolkata
101            Karachi
99               Lagos
34            Shenzhen
            ...
194        Chattanooga
223          Asheville
57                 Pau
220            Hickory
196    Barnstable Town
Name: City / Urban area, Length: 249, dtype: object

In [35]:
cities_df[['City / Urban area', 'Country']]

    City / Urban area     Country
0        Buenos Aires   Argentina
1           Melbourne   Australia
2              Sydney   Australia
3            Brisbane   Australia
4               Perth   Australia
..                ...         ...
244            Canton         USA
245           Spokane         USA
246          Tashkent  Uzbekistan
247  Ho Chi Minh City     Vietnam
248            Harare    Zimbabwe

[249 rows x 2 columns]

In [82]:
contries = cities_df['Country'].value_counts()
contries

USA         105
France       15
Brazil       10
Canada        9
Germany       8
           ...
Malaysia      1
Denmark       1
Peru          1
Hungary       1
Colombia      1
Name: Country, Length: 61, dtype: int64

In [118]:
list(contries[contries == 4].index)

['Italy']

In [81]:
contries = cities_df['Country'].value_counts()
contries

for i in contries[contries > 4] :
    print(type(i))

<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>
<class 'int'>

<br><br>
### 수강신청 가능 여부 판단하기

1. "information technology" 과목은 심화과목이라 1학년은 수강할 수 없습니다.
2. "commerce" 과목은 기초과목이고 많은 학생들이 듣는 수업이라 4학년은 수강할 수 없습니다.
3. 수강생이 5명이 되지 않으면 강의는 폐강 되어 수강할 수 없습니다.  

기존 DataFrame에 `status`라는 이름의 column을 추가하고, 학생이 수강 가능한 상태이면 `allowed`, 수강 불가능한 상태이면 `not allowed`를 넣어주세요.

In [120]:
import pandas as pd

df = pd.read_csv('data/enrolment_1.csv')

df['status'] = 'allowed'

# 조건 1
df.loc[(df['year'] == 1) & (df['course name'] == 'information technology'), 'status'] = 'not allowed'
# 조건 2
df.loc[(df['year'] == 4) & (df['course name'] == 'commerce'), 'status'] = 'not allowed'

# 조건 3
course_counts = df['course name'].value_counts()
for course in list(course_counts[course_counts < 5].index) :
    df.loc[df['course name'] == course, 'status'] = 'not allowed'

print(df)

           id  year           course name   status
0     2777729     1               science  allowed
1     2777730     2               science  allowed
2     2777765     1                  arts  allowed
3     2777766     2                  arts  allowed
4     2777785     1                   mba  allowed
...       ...   ...                   ...      ...
1995  2796805     3  computer application  allowed
1996  2796812     1               nursing  allowed
1997  2796813     2               nursing  allowed
1998  2796814     3               nursing  allowed
1999  2796815     4               nursing  allowed

[2000 rows x 4 columns]